
PERFORM UNTIL LG2G0-DATA-IX > LG2G0-MAX-IX
    IF LG2G0-IDROLL(LG2G0-DATA-IX) = 'DCNFUNC'
        IF LG2G0-FLX-GODK(LG2G0-DATA-IX) = JA
    ELSE
    
    END-IF
    
END-PERFORM